[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
    "category_id": "1",

    "chefPicture": "https://www.onlinedegree.com/wp-content/uploads/2016/11/master_chef.jpg",
    "chefName": "John",
    "yearsOfExperience":8 ,
    "numOfRecipes": 40,
    "likes": 900,

    "fast_recipe_ingredients": {
      "number_one": "4 cups water",
      "number_two": "1 teaspoon fine salt",
      "number_three": "1 cup polenta",
      "number_four": "3 tablespoons butter, divided",
      "number_five": "½ cup freshly grated Parmigiano-Reggiano cheese, plus more for garnish"
      },


    "fast_recipe_cooking_method" :{
      "number_one": "Add the polenta to salted boiling water",
      "number_two": "Simmer until the polenta is slightly thick",
      "number_three": "Cover and continue cooking until the polenta is very thick",
      "number_four": "Stir in the butter and cheese"
    } ,

    "fast_recipe_rating" : 4,

    "second_recipe_ingredients": {
      "number_one": "1 pound sweet Italian sausage",
      "number_two": "¾ pound lean ground beef",
      "number_three": "½ cup minced onion",
      "number_four": "2 cloves garlic, crushed",
      "number_five": "2 cloves garlic, crushed"
      },


    "second_recipe_cooking_method" :{
      "number_one": "Cook sausage, ground beef, onion, and garlic in a Dutch oven over medium heat until well browned.",
      "number_two": "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes.",
      "number_three": "Preheat the oven to 375 degrees F (190 degrees C).",
      "number_four": "To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish."
    } ,
    
    "second_recipe_rating" : 4.5,


    "third_recipe_ingredients": {
      "number_one": "large onion",
      "number_two": "medium carrots",
      "number_three": "celery stalks",
      "number_four": "garlic cloves",
      "number_five": "bunches Tuscan kale"
      },


    "third_recipe_cooking_method" :{
      "number_one": "Place a rack in middle of oven; preheat to 450°.",
      "number_two": "Wash, peel, and trim 3 medium carrots. Cut in half (or in quarters lengthwise if they’re large), then cut crosswise into pieces.",
      "number_three": "Chop 2 celery stalks crosswise into pieces. Add to bowl with the rest of the mirepoix.",
      "number_four": "Smash and peel 8 garlic cloves with the back of your knife. If any of them are left more or less intact after that initial smashing, give them another good wack with the back of your knife so they really open up and start to break apart. Add to bowl, also."
    } ,
    
    "third_recipe_rating" :5,


    "fast_recipe_name": "Polenta",
    "second_recipe_name": "Lasagne",
    "third_recipe_name": "Ribollita",
    "description": "Because I'm a chef, I eat out frequently, so it's hard for me to control what I consume in terms of calories. But when I'm at home, I eat what my wife cooks for me. She works hard to avoid making foods that are high in calories and cholesterol, so most of the time, she makes vegetarian dishes."
  },

  {
    "_id": "f69a695f037cd9484cecaea37ca71012",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "2",
    "chefPicture": "https://www.simplybusiness.co.uk/static/896d58b532c8e2ec7ac1719fe62b37ae/b6518/how-to-become-a-chef.jpg",
    "chefName": "Jane",
    "yearsOfExperience": 8,
    "numOfRecipes": 40,
    "likes": 900,


    "fast_recipe_ingredients": {
      "number_one": "1 summer squash",
      "number_two": "1 zucchini  ",
      "number_three": "1/2 tsp salt",
      "number_four": "1 pint cherry tomatoes ",
      "number_five": "1/2 red onion"
      },


    "fast_recipe_cooking_method" :{
      "number_one": "cook the tortellini according to the package directions. Then drain well and cool in a very large bowl in the fridge",
      "number_two": "While the tortellini is cooking, slice the summer squash and the zucchini into 1/4-inch rounds and then quarter the rounds",
      "number_three": "Slice the cherry tomatoes in half. Slice the red onion in 1/4 inch half moons and soak it in cold water to dull its sharp flavor",
      "number_four": "Once the tortellini has cooled, top it with the cherry tomatoes, red onion, baby spinach, and sliced black olives."
    } ,

    "fast_recipe_rating" :3.5,

    "second_recipe_ingredients": {
      "number_one": "2 potatoes, peeled",
      "number_two": "2 cups all-purpose flour",
      "number_three": "1 egg"
      },


    "second_recipe_cooking_method" :{
      "number_one": "Bring a large pot of salted water to a boil; add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool, and mash with a fork or potato masher.",
      "number_two": "Combine 1 cup mashed potato, flour, and egg in a large bowl. Knead until dough forms a ball. Shape small portions of the dough into long snakes. On a floured surface, cut snakes into 1/2-inch pieces.",
      "number_three": "Bring a large pot of lightly salted water to a boil. Drop in gnocchi and cook for 3 to 5 minutes or until gnocchi have risen to the top; drain and serve."
    } ,
    
    "second_recipe_rating" : 2,


    "third_recipe_ingredients": {
      "number_one": "50 g of basil leaves (about 60-65 leaves)",
      "number_two": "1/2 cup of extra virgin olive oil",
      "number_three": "70 g (3/4 cup) of Parmigiano Reggiano or Grana Padano",
      "number_four": "30 g (2 tablespoons) of Pecorino Fiore Sardo ",
      "number_five": "2 peeled garlic cloves"
     
      },


    "third_recipe_cooking_method" :{
      "number_one": " the blades and the bowl of the food processor. Put them into the refrigerator for about 10 minutes until the tools are very cold.",
      "number_two": "Now dry the leaves very well on a kitchen towel (important: the basil leaves must be very dry)",
      "number_three": "Chop the ingredients coarsely for a few seconds. Then add salt and Pecorino Fiore Sardo cheese cut into small pieces",
      "number_four": " Before seasoning your pasta dish, if the pesto is too thick, add 1 or 2 tablespoons of the cooking water"
    } ,
    
    "third_recipe_rating" :4,


    "fast_recipe_name": "Tortellini Salad",
    "second_recipe_name": "Gnocchi",
    "third_recipe_name": "Pesto alla Genovese",
    "description": "I think every chef, not just in America, but across the world, has a double-edged sword - two jackets, one that's driven, a self-confessed perfectionist, thoroughbred, hate incompetence and switch off the stove, take off the jacket and become a family man."
  },

  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "3",
    "chefPicture": "https://news.harvard.edu/wp-content/uploads/2022/12/Chef-Ben-Howe-and-DELISH-Dishes-2-1200x800.jpg",
    "chefName": "Bob",
    "yearsOfExperience": 15,
    "numOfRecipes": 80,



    "likes": 1200,
    "fast_recipe_ingredients": {
      "number_one": "1 large onion",
      "number_two": "2 medium carrots",
      "number_three": "8 celery stalks",
      "number_four": "2 bunches Tuscan kale",
      "number_five": "1 small wedge of Parmesan with rind"
      },


    "fast_recipe_cooking_method" :{
      "number_one": " cut 1 large onion in half through root. Peel and discard skins. Finely chop and transfer to a medium bowl.",
      "number_two": "Wash, peel, and trim 3 medium carrots. Cut in half (or in quarters lengthwise if they’re large), then cut crosswise into  pieces.",
      "number_three": "Chop 2 celery stalks crosswise into ½ pieces. Add to bowl with the rest of the mirepoix.",
      "number_four": "Smash and peel 8 garlic cloves with the back of your knife. If any of them are left more or less intact after that initial smashing, give them another good wack with the back of your knife so they really open up and start to break apart. Add to bowl, also."
    } ,

    "fast_recipe_rating" : 3.5,

    "second_recipe_ingredients": {
      "number_one": "3/4 cup olive oil",
      "number_two": "6 tablespoons (3/4 stick) unsalted butter, room temperature",
      "number_three": "12 anchovy fillets",
      "number_four": "6 large garlic cloves, chopped",
      "number_five": "1 1-pound loaf crusty Italian or French bread, cutinto 2-inch sections"
      },


    "second_recipe_cooking_method" :{
      "number_one": "Blend oil, butter, anchovies and garlic in processor until smooth. Transfer oil mixture to heavy medium saucepan. Cook over low heat 15 minutes, stirring, occasionally. (Sauce will separate.) Season with salt and pepper.",
      "number_two": "Pour sauce into fondue pot or other flameproof casserole. Set pot over alcohol burner or gas table burner to keep warm. Serve with vegetables and bread."
    } ,
    
    "second_recipe_rating" : 5,


    "third_recipe_ingredients": {
      "number_one": "1 lbs fresh tortelloni or tortellini",
      "number_two": "4 tbsp sun-dried tomato pesto I used Scala or Delallo in the US",
      "number_three": "1-2 cloves garlic",
      "number_four": "4 basil leaves or ½ tsp dried basil",
      "number_five": "250ml/1 cup double/heavy whipping cream"
      },


    "third_recipe_cooking_method" :{
      "number_one": "Set a large pot of salted water boiling and cook the tortelloni according to package instructions.",
      "number_two": "Meanwhile in a large and deep pan heat the sun-dried tomato pesto together with minced garlic over low heat and fry while stirring for no longer than 30 seconds.",
      "number_three": "Drain the tortelloni while reserving ½ cup of pasta water. Add the tortelloni directly to the sauce and toss gently to combine."
    } ,
    
    "third_recipe_rating" :4.5,


    "fast_recipe_name": "Ribollita",
    "second_recipe_name": "Bagna Cauda",
    "third_recipe_name": "Tortelli and Ravioli",
    "description": "I've been fascinated by the world ever since I read 'Kitchen Confidential' by Anthony Bourdain. I've watched 'Top Chef' and watched interviews with chefs on 'Charlie Rose'... I thought they're really intriguing characters, and they really encapsulate that tension between vision and commerce, art and commerce."
  },

  {
    "_id": "e342b6c0c8efc8ca9e811991dc8a7900",
    "others_info": {
      "is_todays_pick": true,
      "is_trending": false
    },
    "category_id": "4",
    "chefPicture": "https://www.liveabout.com/thmb/m5sj1tnGvr2OIw4gPx73tw_vvho=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-607047661-571e40a75f9b58857dfd0e72.jpg",
    "chefName": "Alice",
    "yearsOfExperience": 5,
    "numOfRecipes": 30,
    "likes": 800,
    "fast_recipe_ingredients": {
      "number_one": "500g strong bread flour, plus extra for dusting",
      "number_two": "7g dried fast action yeast",
      "number_three": "2 tsp fine sea salt",
      "number_four": "5 tbsp olive oil, plus extra for the tin and to serve",
      "number_five": "1 tsp flaky sea salt"
      },


    "fast_recipe_cooking_method" :{
      "number_one": "Tip the flour into a large mixing bowl. Mix the yeast into one side of the flour, and the fine salt into the other side.",
      "number_two": "Make a well in the middle of the flour and add 2 tbsp oil and 350-400ml lukewarm water, adding it gradually until you have a slightly sticky dough (you may not need all the water).",
      "number_three": "Oil a rectangle, shallow tin (25 x 35cm). Tip the dough onto the work surface, then stretch it to fill the tin.",
      "number_four": "Heat the oven to 220C/200C fan/gas 7. Press your fingers into the dough to make dimples. Mix together 1½ tbsp olive oil, 1 tbsp water and the flaky salt and drizzle over the bread."
    } ,

    "fast_recipe_rating" : 4.5,

    "second_recipe_ingredients": {
      "number_one": "2 tbsp olive oil",
      "number_two": "15g unsalted butter",
      "number_three": "1 onion, finely chopped",
      "number_four": "1 large garlic clove, crushed",
      "number_five": "350g risotto rice"
      },


    "second_recipe_cooking_method" :{
      "number_one": "eat the oil and butter in a saucepan until foamy. Add the onion and a pinch of salt and fry gently over a low heat for 15 mins, or until softened and translucent.",
      "number_two": "Scoop the cooled risotto into 18 equal portions – they should be slightly larger than a golf ball.",
      "number_three": "Put the flour, eggs and breadcrumbs into three separate shallow bowls. Dip each prepared risotto ball into the flour, followed by the eggs and finally, the breadcrumbs.",
      "number_four": "Half-fill a large, heavy-based saucepan with vegetable oil and heat over medium-low until it reads 170C on a cooking thermometer or until a piece of bread turns golden brown in the oil within 45 seconds."
    } ,
    
    "second_recipe_rating" :5,


    "third_recipe_ingredients": {
      "number_one": "Flour 00 2 ¼ cups (250 g)",
      "number_two": "Water 1 ¼ cup (285 g) - lukewarm",
      "number_three": "Fresh brewer's yeast 1.8 tsp (8.5 g)",
      "number_four": "Fine salt 2 tsp (10 g)",
      "number_five": "Manitoba flour 2 cups (250 g)"
      },


    "third_recipe_cooking_method" :{
      "number_one": "into a bowl, crumble fresh brewer's yeast  and add sugar.",
      "number_two": "Add half the water  and start working with a flat pastry cutter.",
      "number_three": "add salt. added remaining water  and keep working with a flat pastry cutter.",
      "number_four": "add oil.and start kneading with your hands. As soon as the dough has taken on consistency, place it on a flat surface and knead for a few minutes until it is smooth and homogeneous."
    } ,
    
    "third_recipe_rating" :3.5,


    "fast_recipe_name": "Focaccia",
    "second_recipe_name": " Arancini",
    "third_recipe_name": "Panzerotto fritto",
    "description": "The biggest challenge of being a pastry chef is that, unlike other types of chefs, you can't throw things together at a farmer's market. When you're working with baking powder and a formula, you have to be exact. If not, things can go wrong."
  },
  
  {
    "_id": "f06f8cc035b04bd1158e4198281915a3",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "5",
    "chefPicture": "https://www.hitsa.com.au/wp-content/uploads/types-of-chefs-1030x687.jpg",
    "chefName": "Tom",
    "yearsOfExperience": 12,
    "numOfRecipes": 60,
    "likes": 1100,
    "fast_recipe_ingredients": {
      "number_one": "2 to 3-pound bone-in porterhouse steak.",
      "number_two": "Herbs I like to use a combination of fresh rosemary, sage, and thyme.",
      "number_three": "Seasonings In addition to salt and pepper, you can use a little granulated garlic and onion to enhance the flavor.",
      "number_four": "3 tablespoons butter, divided",
      "number_five": "some good olive oil and unsalted butter for this recipe."
      },


    "fast_recipe_cooking_method" :{
      "number_one": "Make the baster by wrapping the fresh herbs up in butcher’s twine.",
      "number_two": "brush both sides of the steak with olive oil.",
      "number_three": "Season the steak on both sides with salt, pepper, onion, and garlic granules.Make sure your griddle is hot before placing down your meat, and cook it for 4-6 minutes per side for a beautiful rare steak.",
      "number_four": "While the meat is cooking, be sure to baste it with the butter and brush it with the fresh herbs for just an awesome little added touch to this recipe.  Once the steak is done, let it rest for 3 to 4 minutes."
    } ,

    "fast_recipe_rating" : 5,

    "second_recipe_ingredients": {
      "number_one": "2 tablespoons extra-virgin olive oil",
      "number_two": "1 medium yellow onion, diced",
      "number_three": "2 medium carrots, chopped",
      "number_four": "2 celery ribs, thinly sliced",
      "number_five": "1 teaspoon sea salt, plus more to taste"
      },


    "second_recipe_cooking_method" :{
      "number_one": "Heat the oil in a large pot over medium heat. Add the onion, carrots, celery, salt, and several grinds of black pepper, and cook, stirring occasionally, for 8 minutes, until the vegetables begin to soften.",
      "number_two": "Add the garlic, tomatoes, beans, green beans, broth, bay leaves, oregano, and thyme. Cover and simmer for 20 minutes.",
      "number_three": "Stir in the pasta and cook, uncovered, for 10 more minutes, until the pasta is cooked through.",
      "number_four": "Season to taste and serve with parsley, red pepper flakes, and parmesan, if desired."
    } ,
    
    "second_recipe_rating" : 4.5,


    "third_recipe_ingredients": {
      "number_one": "1 cup Parmesan cheese, finely grated"
      },


    "third_recipe_cooking_method" :{
      "number_one": "Gather the ingredients. Preheat the oven to 375 F. Line a large rimmed baking sheet with parchment paper or a silicone mat.",
      "number_two": "Working in batches, scoop 1 tablespoon mounds of finely grated Parmesan cheese onto the prepared baking sheet. Evenly spread each mound about 3 inches wide and space at least 1-inch apart.",
      "number_three": "Bake until light brown and melted, 5 to 6 minutes (check occasionally while baking to ensure they don't turn too brown).",
      "number_four": "It is possible to shape a frico into different forms. It is necessary to work quickly while they are still warm since they harden as they cool. "
    } ,
    
    "third_recipe_rating" :5,


    "fast_recipe_name": "Fiorentina",
    "second_recipe_name": "Minestrone Soup",
    "third_recipe_name": "Frico",
    "description": "I tell a student that the most important class you can take is technique. A great chef is first a great technician. 'If you are a jeweler, or a surgeon or a cook, you have to know the trade in your hand. You have to learn the process. You learn it through endless repetition until it belongs to you."
  },
  
  
  {
    "_id": "4e6092d54c18fbd89ad59e88a1e87fbb",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": false
    },
    "category_id": "6",
    "chefPicture": "https://grewallevymarketing.files.wordpress.com/2013/01/79253570.jpg",
    "chefName": "Mary",
    "yearsOfExperience": 7,
    "numOfRecipes": 35,
    "likes": 950,
    "fast_recipe_ingredients": {
      "number_one": "700g of lamb shoulder, or mutton, diced into 2–3cm cubes",
      "number_two": "1 sprig of rosemary",
      "number_three": "olive oil",
      "number_four": "sea salt",
      "number_five": "freshly ground black pepper"
      },


    "fast_recipe_cooking_method" :{
      "number_one": "Place the lamb in a bowl with the rosemary and olive oil and season with salt and pepper. Mix well and set aside while you preheat a barbecue for direct cooking",
      "number_two": "If using wooden skewers, leave to soak in cold water for at least 20 minutes, to prevent them burning during cooking",
      "number_three": "Thread the lamb onto the skewers neatly, ensuring an even distribution between fat and meat",
      "number_four": "Once the coals in the barbecue have turned an ashy white, cook the skewers for 2–3 minutes, turning them halfway through"
    } ,

    "fast_recipe_rating" : 3.5,

    "second_recipe_ingredients": {
      "number_one": "1 tbsp of butter",
      "number_two": "1 tbsp of extra virgin olive oil",
      "number_three": "1/2 small carrot, finely chopped",
      "number_four": "1/2 small onion, finely chopped",
      "number_five": "1/2 celery stick, finely chopped"
      },


    "second_recipe_cooking_method" :{
      "number_one": "In a large skillet, melt the butter with the olive oil. When hot and bubbly, add the chopped carrot, onion and celery and fry gently until softened, about 10 minutes",
      "number_two": "Add the pork and beef mince and brown the meat for about 10 minutes, stirring often",
      "number_three": "Next add the wine and leave it to evaporate. Season with salt, pepper and nutmeg",
      "number_four": "Cover and carry on cooking over a low heat for about 20 minutes, stirring often. (Add a little bit of stock or wine if the mixture becomes too dry.) Remove from the heat and set aside"
    } ,
    
    "second_recipe_rating" : 4.5,


    "third_recipe_ingredients": {
      "number_one": "1kg whole sardines, gutted, scaled and heads removed",
      "number_two": "40g of plain flour, sifted",
      "number_three": "sunflower oil, for frying",
      "number_four": "1kg white onion, finely sliced",
      "number_five": "160ml of white wine vinegar"
      },


    "third_recipe_cooking_method" :{
      "number_one": "Rinse the sardines under cold water then pat dry with kitchen paper. Place the flour in a large bowl, add the sardines and toss to dust evenly. Shake off any excess",
      "number_two": "Fill two-thirds of a medium, high-sided frying pan with sunflower oil. Place it over a medium-high heat and wait until it reaches 180°C",
      "number_three": "Slip in a batch of sardines (6–8, depending on size). Fry for a couple of minutes on each side, or until crisp outside and opaque inside. Drain and transfer to a plate covered with kitchen paper. Salt generously and repeat with the remaining sardines, working in batches",
      "number_four": "Discard the oil with the exception of a very thin film – just enough to coat the bottom of the frying pan. Set this back over a medium heat, add the onions and sweat gently until very soft, stirring often so they don’t brown"
    } ,
    
    "third_recipe_rating" :5,


    "fast_recipe_name": " Arrosticini",
    "second_recipe_name": "Olive Ascolante",
    "third_recipe_name": "Sardine in Saor",
    "description": "Cooking is not difficult. Everyone has taste, even if they don't realize it. Even if you're not a great chef, there's nothing to stop you understanding the difference between what tastes good and what doesn't."
  }
]